fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикРаботы/ВКМ_ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/CommonModules/ВКМ_ЗарплатаСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполняет регистр сведений ВКМ_ГрафикРаботы по пятидневной рабочей неделе
// за указанный период. Уже заполненные даты не перезаписываются.
//
// Параметры:
//  ДатаНачала - Дата - начало периода заполнения.
//  ДатаОкончания - Дата - окончание периода заполнения.
//
Процедура ЗаполнитьГрафикРаботы(Знач ДатаНачала, Знач ДатаОкончания) Экспорт
	
	ДатаНачала = НачалоДня(ДатаНачала);
	ДатаОкончания = НачалоДня(ДатаОкончания);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикРаботы.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.ВКМ_ГрафикРаботы КАК ГрафикРаботы
	|ГДЕ
	|	ГрафикРаботы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ЗаполненныеДаты = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполненныеДаты.Вставить(Выборка.Дата, Истина);
	КонецЦикла;
	
	ТекущаяДата = ДатаНачала;
	Пока ТекущаяДата <= ДатаОкончания Цикл
		
		Если ЗаполненныеДаты[ТекущаяДата] = Неопределено Тогда
			МенеджерЗаписи = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Дата = ТекущаяДата;
			МенеджерЗаписи.Значение = ?(ДеньНедели(ТекущаяДата) < 6, 1, 0);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДата + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
